import streamlit as st
import yfinance as yf
import pandas as pd

ticker_to_arabic_name = {
    "1010.SR" :	"بنك الرياض"
    "1020.SR" :	"بنك الجزيرة"
    "1030.SR" :	"البنك السعودي للإستثمار"
    "1050.SR" :	"البنك السعودي الفرنسي"
    "1060.SR" :	"البنك السعودي الأول"
    "1080.SR" :	"البنك العربي الوطني"
    "1111.SR" :	"شركة مجموعة تداول السعودية القابضة"
    "1120.SR" :	"مصرف الراجحي"
    "1140.SR" :	"بنك البلاد"
    "1150.SR" :	"مصرف الإنماء"
    "1180.SR" :	"البنك الأهلي السعودي"
    "1182.SR" :	"شركة أملاك العالمية للتمويل"
    "1183.SR" :	"شركة سهل للتمويل"
    "1201.SR" :	"شركة تكوين المتطورة للصناعات"
    "1202.SR" :	"شركة الشرق الأوسط لصناعة وإنتاج الورق"
    "1210.SR" :	"شركة الصناعات الكيميائية الأساسية"
    "1211.SR" :	"شركة التعدين العربية السعودية"
    "1212.SR" :	"مجموعة أسترا الصناعية"
    "1213.SR" :	"شركة نسيج العالمية التجارية"
    "1214.SR" :	"شركة الحسن غازي إبراهيم شاكر"
    "1301.SR" :	"شركة إتحاد مصانع الأسلاك"
    "1302.SR" :	"شركة بوان"
    "1303.SR" :	"شركة الصناعات الكهربائية"
    "1304.SR" :	"شركة اليمامة للصناعات الحديدية"
    "1320.SR" :	"الشركة السعودية لأنابيب الصلب"
    "1321.SR" :	"شركة أنابيب الشرق المتكاملة للصناعة"
    "1322.SR" :	"شركة المصانع الكبرى للتعدين"
    "1810.SR" :	"مجموعة سيرا القابضة"
    "1820.SR" :	"مجموعة عبدالمحسن الحكير للسياحة والتنمية"
    "1830.SR" :	"شركة لجام للرياضة"
    "1831.SR" :	"شركة مهارة للموارد البشرية"
    "1832.SR" :	"شركة صدر للخدمات اللوجستية"
    "1833.SR" :	"شركة الموارد للقوى البشرية"
    "1834.SR" :	"الشركة السعودية لحلول القوى البشرية"
    "2001.SR" :	"شركة كيمائيات الميثانول"
    "2010.SR" :	"الشركة السعودية للصناعات الأساسية"
    "2020.SR" :	"شركة سابك للمغذيات الزراعية"
    "2030.SR" :	"شركة المصافي العربية السعودية"
    "2040.SR" :	"شركة الخزف السعودي"
    "2050.SR" :	"مجموعة صافولا"
    "2060.SR" :	"شركة التصنيع الوطنية"
    "2070.SR" :	"الشركة السعودية للصناعات الدوائية والمستلزمات الطبية"
    "2080.SR" :	"شركة الغاز والتصنيع الأهلية"
    "2081.SR" :	"شركة الخريف لتقنية المياه والطاقة"
    "2082.SR" :	"شركة أكوا باور"
    "2083.SR" :	"شركة مرافق الكهرباء والمياه بالجبيل وينبع"
    "2084.SR" :	"شركة مياهنا"
    "2090.SR" :	"شركة الجبس الأهلية"
    "2100.SR" :	"شركة وفرة للصناعة والتنمية"
    "2110.SR" :	"شركة الكابلات السعودية"
    "2120.SR" :	"الشركة السعودية للصناعات المتطورة"
    "2130.SR" :	"الشركة السعودية للتنمية الصناعية"
    "2140.SR" :	"شركة أيان للإستثمار"
    "2150.SR" :	"شركة الصناعات الزجاجية الوطنية"
    "2160.SR" :	"شركة أميانتيت العربية السعودية"
    "2170.SR" :	"شركة اللجين"
    "2180.SR" :	"شركة تصنيع مواد التعبئة والتغليف"
    "2190.SR" :	"شركة البنى التحتية المستدامة القابضة"
    "2200.SR" :	"الشركة العربية للأنابيب"
    "2210.SR" :	"شركة نماء للكيماويات"
    "2220.SR" :	"الشركة الوطنية لتصنيع وسبك المعادن"
    "2222.SR" :	"شركة الزيت العربية السعودية"
    "2223.SR" :	"شركة أرامكو السعودية لزيوت الأساس"
    "2230.SR" :	"الشركة الكيميائية السعودية القابضة"
    "2240.SR" :	"شركة الزامل للإستثمار الصناعي"
    "2250.SR" :	"المجموعة السعودية للإستثمار الصناعي"
    "2270.SR" :	"الشركة السعودية لمنتجات الألبان والأغذية"
    "2280.SR" :	"شركة المراعي"
    "2281.SR" :	"شركة التنمية الغذائية"
    "2282.SR" :	"شركة نقي للمياه"
    "2283.SR" :	"شركة المطاحن الأولى"
    "2284.SR" :	"شركة المطاحن الحديثة للمنتجات الغذائية"
    "2285.SR" :	"شركة المطاحن العربية للمنتجات الغذائية"
    "2286.SR" :	"شركة المطاحن الرابعة"
    "2290.SR" :	"شركة ينبع الوطنية للبتروكيماويات"
    "2300.SR" :	"الشركة السعودية لصناعة الورق"
    "2310.SR" :	"شركة الصحراء العالمية للبتروكيماويات"
    "2320.SR" :	"شركة البابطين للطاقة والإتصالات"
    "2330.SR" :	"الشركة المتقدمة للبتروكيماويات"
    "2340.SR" :	"شركة ارتيكس للاستثمار الصناعي"
    "2350.SR" :	"شركة كيان السعودية للبتروكيماويات"
    "2360.SR" :	"الشركة السعودية لإنتاج الأنابيب الفخارية"
    "2370.SR" :	"شركة الشرق الأوسط للكابلات المتخصصة"
    "2380.SR" :	"شركة رابغ للتكرير والبتروكيماويات"
    "2381.SR" :	"شركة الحفر العربية"
    "2382.SR" :	"شركة أديس القابضة"
    "3002.SR" :	"شركة أسمنت نجران"
    "3003.SR" :	"شركة أسمنت المدينة"
    "3004.SR" :	"شركة أسمنت المنطقة الشمالية"
    "3005.SR" :	"شركة أسمنت ام القرى"
    "3007.SR" :	"شركة زهرة الواحة للتجارة"
    "3008.SR" :	"شركة الكثيري القابضة"
    "3010.SR" :	"شركة أسمنت العربية"
    "3020.SR" :	"شركة أسمنت اليمامة"
    "3030.SR" :	"شركة الأسمنت السعودية"
    "3040.SR" :	"شركة أسمنت القصيم"
    "3050.SR" :	"شركة أسمنت المنطقة الجنوبية"
    "3060.SR" :	"شركة أسمنت ينبع"
    "3080.SR" :	"شركة أسمنت المنطقة الشرقية"
    "3090.SR" :	"شركة أسمنت تبوك"
    "3091.SR" :	"شركة أسمنت الجوف"
    "3092.SR" :	"شركة أسمنت الرياض"
    "4001.SR" :	"شركة أسواق عبدالله العثيم"
    "4002.SR" :	"شركة المواساة للخدمات الطبية"
    "4003.SR" :	"الشركة المتحدة للإلكترونيات"
    "4004.SR" :	"شركة دله للخدمات الصحية"
    "4005.SR" :	"الشركة الوطنية للرعاية الطبية"
    "4006.SR" :	"الشركة السعودية للتسويق"
    "4007.SR" :	"شركة الحمادي القابضة"
    "4008.SR" :	"الشركة السعودية للعدد والأدوات"
    "4009.SR" :	"شركة الشرق الأوسط للرعاية الصحية"
    "4011.SR" :	"شركة لازوردي للمجوهرات"
    "4012.SR" :	"شركة ثوب الأصيل"
    "4013.SR" :	"مجموعة الدكتور سليمان الحبيب للخدمات الطبية"
    "4014.SR" :	"شركة دار المعدات الطبية والعلمية"
    "4015.SR" :	"شركة مصنع جمجوم للأدوية"
    "4016.SR" :	"شركة الشرق الأوسط للصناعات الدوائية"
    "4017.SR" :	"شركة مستشفى الدكتور سليمان عبدالقادر فقيه"
    "4020.SR" :	"الشركة العقارية السعودية"
    "4030.SR" :	"الشركة الوطنية السعودية للنقل البحري"
    "4031.SR" :	"الشركة السعودية للخدمات الأرضية"
    "4040.SR" :	"الشركة السعودية للنقل الجماعي"
    "4050.SR" :	"شركة باعظيم التجارية"
    "4051.SR" :	"مجموعة أنعام الدولية القابضة"
    "4061.SR" :	"شركة تهامة للإعلان والعلاقات العامة"
    "4070.SR" :	"الشركة العربية للتعهدات الفنية"
    "4071.SR" :	"شركة مجموعة إم بي سي"
    "4072.SR" :	"شركة سناد القابضة"
    "4080.SR" :	"شركة النايفات للتمويل"
    "4081.SR" :	"شركة المرابحة المرنة للتمويل"
    "4082.SR" :	"شركة طيبة للإستثمار"
    "4090.SR" :	"شركة مكة للإنشاء والتعمير"
    "4100.SR" :	"شركة باتك للإستثمار والأعمال اللوجستية"
    "4110.SR" :	"شركة الباحة للإستثمار والتنمية"
    "4130.SR" :	"الشركة السعودية للصادرات الصناعية"
    "4140.SR" :	"شركة العمران للصناعة والتجارة"
    "4141.SR" :	"شركة مجموعة كابلات الرياض"
    "4142.SR" :	"شركة مجموعة التيسير تالكو الصناعية"
    "4143.SR" :	"شركة الرياض للتعمير"
    "4150.SR" :	"شركة ثمار التنمية القابضة"
    "4160.SR" :	"شركة بن داود القابضة"
    "4161.SR" :	"شركة المنجم للأغذية"
    "4162.SR" :	"شركة الدواء للخدمات الطبية"
    "4163.SR" :	"شركة النهدي الطبية"
    "4164.SR" :	"شركة الماجد للعود"
    "4165.SR" :	"شركة المشروعات السياحية"
    "4170.SR" :	"مجموعة فتيحي القابضة"
    "4180.SR" :	"شركة جرير للتسويق"
    "4190.SR" :	"شركة عبد الله سعد محمد أبو معطي للمكتبات"
    "4191.SR" :	"شركة متاجر السيف للتنمية والاستثمار"
    "4192.SR" :	"شركة الدريس للخدمات البترولية و النقليات"
    "4200.SR" :	"المجموعة السعودية للأبحاث والإعلام"
    "4210.SR" :	"إعمار المدينة الإقتصادية"
    "4220.SR" :	"شركة البحر الأحمر العالمية"
    "4230.SR" :	"شركة فواز عبدالعزيز الحكير وشركاه"
    "4240.SR" :	"شركة جبل عمر للتطوير"
    "4250.SR" :	"الشركة المتحدة الدولية للمواصلات"
    "4260.SR" :	"شركة ذيب لتأجير السيارات"
    "4261.SR" :	"شركة لومي للتأجير"
    "4262.SR" :	"شركة سال السعودية للخدمات اللوجستية"
    "4263.SR" :	"الشركة السعودية للطباعة والتغليف"
    "4270.SR" :	"شركة المملكة القابضة"
    "4280.SR" :	"شركة الخليج للتدريب والتعليم"
    "4290.SR" :	"الشركة الوطنية للتربية و التعليم"
    "4291.SR" :	"شركة عطاء التعليمية"
    "4292.SR" :	"شركة دار الأركان للتطوير العقاري"
    "4300.SR" :	"مدينة المعرفة الإقتصادية"
    "4310.SR" :	"شركة الأندلس العقارية"
    "4320.SR" :	"شركة المراكز العربية"
    "4321.SR" :	"شركة رتال للتطوير العمراني"
    "4322.SR" :	"شركة سمو العقارية"
    "4323.SR" :	"صندوق الرياض ريت"
    "4330.SR" :	"صندوق الجزيرة ريت"
    "4331.SR" :	"صندوق جدوى ريت الحرمين"
    "4332.SR" :	"صندوق تعليم ريت"
    "4333.SR" :	"صندوق المعذر ريت"
    "4334.SR" :	"صندوق مشاركة ريت"
    "4335.SR" :	"صندوق ملكية عقارات الخليج ريت"
    "4336.SR" :	"صندوق سيكو السعودية ريت"
    "4337.SR" :	"صندوق الأهلي ريت 1"
    "4338.SR" :	"صندوق دراية ريت"
    "4339.SR" :	"صندوق الراجحي ريت"
    "4340.SR" :	"صندوق جدوى ريت السعودية"
    "4342.SR" :	"صندوق سدكو كابيتال ريت"
    "4344.SR" :	"صندوق الإنماء ريت لقطاع التجزئة"
    "4345.SR" :	"صندوق ميفك ريت"
    "4346.SR" :	"صندوق بنيان ريت"
    "4347.SR" :	"صندوق الخبير ريت"
    "4348.SR" :	"صندوق الإنماء ريت الفندقي"
    "4349.SR" :	"صندوق الإستثمار اريك ريت المتنوع"
    "5110.SR" :	"الشركة السعودية للكهرباء"
    "6001.SR" :	"شركة حلواني إخوان"
    "6002.SR" :	"شركة هرفي للخدمات الغذائية"
    "6004.SR" :	"شركة كاتريون للتموين القابضة"
    "6010.SR" :	"الشركة الوطنية للتنمية الزراعية"
    "6012.SR" :	"شركة ريدان الغذائية"
    "6013.SR" :	"شركة الأعمال التطويرية الغذائية"
    "6014.SR" :	"شركة الآمار الغذائية"
    "6015.SR" :	"شركة أمريكانا للمطاعم العالمية بي إل سي - شركة أجنبية"
    "6016.SR" :	"شركة مطاعم بيت الشطيرة للوجبات السريعة"
    "6020.SR" :	"شركة القصيم القابضة للاستثمار"
    "6040.SR" :	"شركة تبوك للتنمية الزراعية"
    "6050.SR" :	"الشركة السعودية للأسماك"
    "6060.SR" :	"شركة الشرقية للتنمية"
    "6070.SR" :	"شركة الجوف الزراعية"
    "6090.SR" :	"شركة جازان للتنمية والاستثمار"
    "7010.SR" :	"شركة الإتصالات السعودية"
    "7020.SR" :	"شركة إتحاد إتصالات"
    "7030.SR" :	"شركة الإتصالات المتنقلة السعودية"
    "7040.SR" :	"شركة إتحاد عذيب للإتصالات"
    "7200.SR" :	"شركة المعمر لأنظمة المعلومات"
    "7201.SR" :	"شركة بحر العرب لأنظمة المعلومات"
    "7202.SR" :	"الشركة العربية لخدمات الإنترنت والاتصالات"
    "7203.SR" :	"شركة علم"
    "7204.SR" :	"شركة العرض المتقن للخدمات التجارية"
    "8010.SR" :	"الشركة التعاونية للتأمين"
    "8012.SR" :	"شركة الجزيرة تكافل تعاوني"
    "8020.SR" :	"شركة ملاذ للتأمين التعاوني"
    "8030.SR" :	"شركة المتوسط والخليج للتأمين وإعادة التأمين التعاوني"
    "8040.SR" :	"شركة أليانز السعودي الفرنسي للتأمين التعاوني"
    "8050.SR" :	"شركة سلامة للتأمين التعاوني"
    "8060.SR" :	"شركة ولاء للتأمين التعاوني"
    "8070.SR" :	"شركة الدرع العربي للتأمين التعاوني"
    "8100.SR" :	"الشركة العربية السعودية للتأمين التعاوني"
    "8120.SR" :	"شركة إتحاد الخليج الأهلية للتأمين التعاوني"
    "8150.SR" :	"المجموعة المتحدة للتأمين التعاوني"
    "8160.SR" :	"شركة التأمين العربية التعاونية"
    "8170.SR" :	"شركة الاتحاد للتأمين التعاوني"
    "8180.SR" :	"شركة الصقر للتأمين التعاوني"
    "8190.SR" :	"الشركة المتحدة للتأمين التعاوني"
    "8200.SR" :	"الشركة السعودية لإعادة التأمين"
    "8210.SR" :	"شركة بوبا العربية للتأمين التعاوني"
    "8230.SR" :	"شركة الراجحي للتأمين التعاوني"
    "8240.SR" :	"شركة تْشب العربية للتأمين التعاوني"
    "8250.SR" :	"مجموعة الخليج للتأمين"
    "8260.SR" :	"الشركة الخليجية العامة للتأمين التعاوني"
    "8270.SR" :	"شركة بروج للتأمين التعاوني"
    "8280.SR" :	"شركة ليفا للتأمين"
    "8300.SR" :	"الشركة الوطنية للتأمين"
    "8310.SR" :	"شركة أمانة للتأمين التعاوني"
    "8311.SR" :	"شركة عناية السعودية للتأمين التعاوني"
    "8313.SR" :	"شركة رسن لتقنية المعلومات"

}

def check_tickers(tickers, percentage):
    results = {}
    multiplier = 1 + (percentage / 100)  # Convert percentage to a multiplier
    
    for ticker in tickers:
        try:
            stock = yf.Ticker(ticker)
            hist = stock.history(period="1y")
            
            if hist.empty:
                continue
            
            # Get the lowest 52-week price
            lowest_price = hist['Low'].min()
            current_price = hist['Close'].iloc[-1]
            
            # Check if current price is between lowest price and lowest price * multiplier
            if lowest_price <= current_price <= lowest_price * multiplier:
                # Remove '.SR' if the ticker is a number
                per = (current_price - lowest_price) / lowest_price * 100
                display_ticker = ticker.replace('.SR', '') if ticker.replace('.SR', '').isdigit() else ticker
                results[display_ticker] = {
                    'الرمز' : display_ticker,
                    'الاسم': ticker_to_arabic_name.get(ticker, 'غير معروف'),
                    'السعر الحالي': round(current_price, 2),
                    'القاع السنوي': round(lowest_price, 2),
                    'نسبة الفرق': f"{round(per, 2)}%" 
                }
        except Exception as e:
            st.error(f"خطأ في معالجة {ticker}: {str(e)}")
    
    return results

# Streamlit app
st.title("فاحص القاع السنوي للأسهم")

# Input for tickers
# Input for tickers
default_tickers = ', '.join([
    '1010.SR', '1020.SR', '1030.SR', '1050.SR', '1060.SR', '1080.SR', 
    '1111.SR', '1120.SR', '1140.SR', '1150.SR', '1180.SR', '1182.SR', 
    '1183.SR', '1201.SR', '1202.SR', '1210.SR', '1211.SR', '1212.SR', 
    '1213.SR', '1214.SR', '1301.SR', '1302.SR', '1303.SR', '1304.SR', 
    '1320.SR', '1321.SR', '1322.SR', '1810.SR', '1820.SR', '1830.SR', 
    '1831.SR', '1832.SR', '1833.SR', '2001.SR', '2010.SR', '2020.SR', 
    '2030.SR', '2040.SR', '2050.SR', '2060.SR', '2070.SR', '2080.SR', 
    '2081.SR', '2082.SR', '2083.SR', '2090.SR', '2100.SR', '2110.SR', 
    '2120.SR', '2130.SR', '2140.SR', '2150.SR', '2160.SR', '2170.SR', 
    '2180.SR', '2190.SR', '2200.SR', '2210.SR', '2220.SR', '2222.SR', 
    '2223.SR', '2230.SR', '2240.SR', '2250.SR', '2270.SR', '2280.SR', 
    '2281.SR', '2282.SR', '2283.SR', '2290.SR', '2300.SR', '2310.SR', 
    '2320.SR', '2330.SR', '2340.SR', '2350.SR', '2360.SR', '2370.SR', 
    '2380.SR', '2381.SR', '2382.SR', '3002.SR', '3003.SR', '3004.SR', 
    '3005.SR', '3007.SR', '3008.SR', '3010.SR', '3020.SR', '3030.SR', 
    '3040.SR', '3050.SR', '3060.SR', '3080.SR', '3090.SR', '3091.SR', 
    '3092.SR', '4001.SR', '4002.SR', '4003.SR', '4004.SR', '4005.SR', 
    '4006.SR', '4007.SR', '4008.SR', '4009.SR', '4011.SR', '4012.SR', 
    '4013.SR', '4014.SR', '4015.SR', '4020.SR', '4030.SR', '4031.SR', 
    '4040.SR', '4050.SR', '4051.SR', '4061.SR', '4070.SR', '4071.SR', 
    '4080.SR', '4081.SR', '4082.SR', '4090.SR', '4100.SR', '4110.SR', 
    '4130.SR', '4140.SR', '4141.SR', '4142.SR', '4150.SR', '4160.SR', 
    '4161.SR', '4162.SR', '4163.SR', '4164.SR', '4170.SR', '4180.SR', 
    '4190.SR', '4191.SR', '4192.SR', '4200.SR', '4210.SR', '4220.SR', 
    '4230.SR', '4240.SR', '4250.SR', '4260.SR', '4261.SR', '4262.SR', 
    '4263.SR', '4270.SR', '4280.SR', '4290.SR', '4291.SR', '4292.SR', 
    '4300.SR', '4310.SR', '4320.SR', '4321.SR', '4322.SR', '4323.SR', 
    '4330.SR', '4331.SR', '4332.SR', '4333.SR', '4334.SR', '4335.SR', 
    '4336.SR', '4337.SR', '4338.SR', '4339.SR', '4340.SR', '4342.SR', 
    '4344.SR', '4345.SR', '4346.SR', '4347.SR', '4348.SR', '4349.SR', 
    '5110.SR', '6001.SR', '6002.SR', '6004.SR', '6010.SR', '6012.SR', 
    '6013.SR', '6014.SR', '6015.SR', '6020.SR', '6040.SR', '6050.SR', 
    '6060.SR', '6070.SR', '6090.SR', '7010.SR', '7020.SR', '7030.SR', 
    '7040.SR', '7200.SR', '7201.SR', '7202.SR', '7203.SR', '7204.SR', 
    '8010.SR', '8012.SR', '8020.SR', '8030.SR', '8040.SR', '8050.SR', 
    '8060.SR', '8070.SR', '8100.SR', '8120.SR', '8150.SR', '8160.SR', 
    '8170.SR', '8180.SR', '8190.SR', '8200.SR', '8210.SR', '8230.SR', 
    '8240.SR', '8250.SR', '8260.SR', '8270.SR', '8280.SR', '8300.SR', 
    '8310.SR', '8311.SR'
])
# Convert default_tickers to uppercase
default_tickers = default_tickers.upper()
tickers_input = st.text_area("أدخل رموز الأسهم (مفصولة بفواصل)", value=default_tickers)
tickers_to_check = [ticker.strip().upper() for ticker in tickers_input.split(',')]


# Input for percentage
percentage_input = st.number_input("أدخل نسبة مستوى الفحص من القاع السنوي (مثلا 10 تعني 10%)", 
                                    min_value=0.0, 
                                    max_value=100.0, 
                                    value=10.0,
                                    step=0.1)

# Button to check prices
if st.button("فحص الأسعار"):
    with st.spinner("جاري فحص الأسعار..."):
        result = check_tickers(tickers_to_check, percentage_input)
    
    # Display results
    if result:
        st.success("الأسهم التي سعرها أعلى من القاع السنوي ولا تزيد عن النسبة المدخلة من القاع السنوي:")
        df = pd.DataFrame.from_dict(result, orient='index')
        st.dataframe(df)
    else:
        st.warning("لا توجد أسهم تطابق معايير الفحص")
